{
    "class_name": "Sequential",
    "keras_version": "2.1.5",
    "config": [
        {
            "class_name": "Conv2D",
            "config": {
                "bias_regularizer": null,
                "padding": "same",
                "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                },
                "kernel_regularizer": null,
                "filters": 32,
                "use_bias": true,
                "dilation_rate": [
                    1,
                    1
                ],
                "bias_constraint": null,
                "kernel_size": [
                    3,
                    3
                ],
                "activation": "linear",
                "dtype": "float32",
                "kernel_constraint": null,
                "name": "conv2d_1",
                "strides": [
                    1,
                    1
                ],
                "activity_regularizer": null,
                "batch_input_shape": [
                    null,
                    96,
                    96,
                    3
                ],
                "data_format": "channels_last",
                "kernel_initializer": {
                    "class_name": "VarianceScaling",
                    "config": {
                        "distribution": "uniform",
                        "seed": null,
                        "scale": 1,
                        "mode": "fan_avg"
                    }
                },
                "trainable": true
            }
        },
        {
            "class_name": "Activation",
            "config": {
                "activation": "relu",
                "name": "activation_1",
                "trainable": true
            }
        },
        {
            "class_name": "BatchNormalization",
            "config": {
                "gamma_initializer": {
                    "class_name": "Ones",
                    "config": {}
                },
                "axis": -1,
                "gamma_constraint": null,
                "gamma_regularizer": null,
                "epsilon": 0.001,
                "center": true,
                "name": "batch_normalization_1",
                "moving_variance_initializer": {
                    "class_name": "Ones",
                    "config": {}
                },
                "moving_mean_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                },
                "beta_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                },
                "beta_regularizer": null,
                "momentum": 0.99,
                "scale": true,
                "beta_constraint": null,
                "trainable": true
            }
        },
        {
            "class_name": "MaxPooling2D",
            "config": {
                "pool_size": [
                    3,
                    3
                ],
                "padding": "valid",
                "name": "max_pooling2d_1",
                "strides": [
                    3,
                    3
                ],
                "data_format": "channels_last",
                "trainable": true
            }
        },
        {
            "class_name": "Dropout",
            "config": {
                "seed": null,
                "noise_shape": null,
                "trainable": true,
                "name": "dropout_1",
                "rate": 0.25
            }
        },
        {
            "class_name": "Conv2D",
            "config": {
                "bias_regularizer": null,
                "padding": "same",
                "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                },
                "kernel_regularizer": null,
                "filters": 64,
                "data_format": "channels_last",
                "bias_constraint": null,
                "kernel_size": [
                    3,
                    3
                ],
                "activation": "linear",
                "name": "conv2d_2",
                "kernel_constraint": null,
                "strides": [
                    1,
                    1
                ],
                "activity_regularizer": null,
                "use_bias": true,
                "dilation_rate": [
                    1,
                    1
                ],
                "kernel_initializer": {
                    "class_name": "VarianceScaling",
                    "config": {
                        "distribution": "uniform",
                        "seed": null,
                        "scale": 1,
                        "mode": "fan_avg"
                    }
                },
                "trainable": true
            }
        },
        {
            "class_name": "Activation",
            "config": {
                "activation": "relu",
                "name": "activation_2",
                "trainable": true
            }
        },
        {
            "class_name": "BatchNormalization",
            "config": {
                "gamma_initializer": {
                    "class_name": "Ones",
                    "config": {}
                },
                "axis": -1,
                "gamma_constraint": null,
                "gamma_regularizer": null,
                "epsilon": 0.001,
                "center": true,
                "name": "batch_normalization_2",
                "moving_variance_initializer": {
                    "class_name": "Ones",
                    "config": {}
                },
                "moving_mean_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                },
                "beta_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                },
                "beta_regularizer": null,
                "momentum": 0.99,
                "scale": true,
                "beta_constraint": null,
                "trainable": true
            }
        },
        {
            "class_name": "Conv2D",
            "config": {
                "bias_regularizer": null,
                "padding": "same",
                "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                },
                "kernel_regularizer": null,
                "filters": 64,
                "data_format": "channels_last",
                "bias_constraint": null,
                "kernel_size": [
                    3,
                    3
                ],
                "activation": "linear",
                "name": "conv2d_3",
                "kernel_constraint": null,
                "strides": [
                    1,
                    1
                ],
                "activity_regularizer": null,
                "use_bias": true,
                "dilation_rate": [
                    1,
                    1
                ],
                "kernel_initializer": {
                    "class_name": "VarianceScaling",
                    "config": {
                        "distribution": "uniform",
                        "seed": null,
                        "scale": 1,
                        "mode": "fan_avg"
                    }
                },
                "trainable": true
            }
        },
        {
            "class_name": "Activation",
            "config": {
                "activation": "relu",
                "name": "activation_3",
                "trainable": true
            }
        },
        {
            "class_name": "BatchNormalization",
            "config": {
                "gamma_initializer": {
                    "class_name": "Ones",
                    "config": {}
                },
                "axis": -1,
                "gamma_constraint": null,
                "gamma_regularizer": null,
                "epsilon": 0.001,
                "center": true,
                "name": "batch_normalization_3",
                "moving_variance_initializer": {
                    "class_name": "Ones",
                    "config": {}
                },
                "moving_mean_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                },
                "beta_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                },
                "beta_regularizer": null,
                "momentum": 0.99,
                "scale": true,
                "beta_constraint": null,
                "trainable": true
            }
        },
        {
            "class_name": "MaxPooling2D",
            "config": {
                "pool_size": [
                    2,
                    2
                ],
                "padding": "valid",
                "name": "max_pooling2d_2",
                "strides": [
                    2,
                    2
                ],
                "data_format": "channels_last",
                "trainable": true
            }
        },
        {
            "class_name": "Dropout",
            "config": {
                "seed": null,
                "noise_shape": null,
                "trainable": true,
                "name": "dropout_2",
                "rate": 0.25
            }
        },
        {
            "class_name": "Conv2D",
            "config": {
                "bias_regularizer": null,
                "padding": "same",
                "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                },
                "kernel_regularizer": null,
                "filters": 128,
                "data_format": "channels_last",
                "bias_constraint": null,
                "kernel_size": [
                    3,
                    3
                ],
                "activation": "linear",
                "name": "conv2d_4",
                "kernel_constraint": null,
                "strides": [
                    1,
                    1
                ],
                "activity_regularizer": null,
                "use_bias": true,
                "dilation_rate": [
                    1,
                    1
                ],
                "kernel_initializer": {
                    "class_name": "VarianceScaling",
                    "config": {
                        "distribution": "uniform",
                        "seed": null,
                        "scale": 1,
                        "mode": "fan_avg"
                    }
                },
                "trainable": true
            }
        },
        {
            "class_name": "Activation",
            "config": {
                "activation": "relu",
                "name": "activation_4",
                "trainable": true
            }
        },
        {
            "class_name": "BatchNormalization",
            "config": {
                "gamma_initializer": {
                    "class_name": "Ones",
                    "config": {}
                },
                "axis": -1,
                "gamma_constraint": null,
                "gamma_regularizer": null,
                "epsilon": 0.001,
                "center": true,
                "name": "batch_normalization_4",
                "moving_variance_initializer": {
                    "class_name": "Ones",
                    "config": {}
                },
                "moving_mean_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                },
                "beta_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                },
                "beta_regularizer": null,
                "momentum": 0.99,
                "scale": true,
                "beta_constraint": null,
                "trainable": true
            }
        },
        {
            "class_name": "Conv2D",
            "config": {
                "bias_regularizer": null,
                "padding": "same",
                "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                },
                "kernel_regularizer": null,
                "filters": 128,
                "data_format": "channels_last",
                "bias_constraint": null,
                "kernel_size": [
                    3,
                    3
                ],
                "activation": "linear",
                "name": "conv2d_5",
                "kernel_constraint": null,
                "strides": [
                    1,
                    1
                ],
                "activity_regularizer": null,
                "use_bias": true,
                "dilation_rate": [
                    1,
                    1
                ],
                "kernel_initializer": {
                    "class_name": "VarianceScaling",
                    "config": {
                        "distribution": "uniform",
                        "seed": null,
                        "scale": 1,
                        "mode": "fan_avg"
                    }
                },
                "trainable": true
            }
        },
        {
            "class_name": "Activation",
            "config": {
                "activation": "relu",
                "name": "activation_5",
                "trainable": true
            }
        },
        {
            "class_name": "BatchNormalization",
            "config": {
                "gamma_initializer": {
                    "class_name": "Ones",
                    "config": {}
                },
                "axis": -1,
                "gamma_constraint": null,
                "gamma_regularizer": null,
                "epsilon": 0.001,
                "center": true,
                "name": "batch_normalization_5",
                "moving_variance_initializer": {
                    "class_name": "Ones",
                    "config": {}
                },
                "moving_mean_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                },
                "beta_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                },
                "beta_regularizer": null,
                "momentum": 0.99,
                "scale": true,
                "beta_constraint": null,
                "trainable": true
            }
        },
        {
            "class_name": "MaxPooling2D",
            "config": {
                "pool_size": [
                    2,
                    2
                ],
                "padding": "valid",
                "name": "max_pooling2d_3",
                "strides": [
                    2,
                    2
                ],
                "data_format": "channels_last",
                "trainable": true
            }
        },
        {
            "class_name": "Dropout",
            "config": {
                "seed": null,
                "noise_shape": null,
                "trainable": true,
                "name": "dropout_3",
                "rate": 0.25
            }
        },
        {
            "class_name": "Flatten",
            "config": {
                "name": "flatten_1",
                "trainable": true
            }
        },
        {
            "class_name": "Dense",
            "config": {
                "bias_regularizer": null,
                "kernel_regularizer": null,
                "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                },
                "bias_constraint": null,
                "activation": "linear",
                "name": "dense_1",
                "units": 1024,
                "kernel_constraint": null,
                "activity_regularizer": null,
                "use_bias": true,
                "kernel_initializer": {
                    "class_name": "VarianceScaling",
                    "config": {
                        "distribution": "uniform",
                        "seed": null,
                        "scale": 1,
                        "mode": "fan_avg"
                    }
                },
                "trainable": true
            }
        },
        {
            "class_name": "Activation",
            "config": {
                "activation": "relu",
                "name": "activation_6",
                "trainable": true
            }
        },
        {
            "class_name": "BatchNormalization",
            "config": {
                "gamma_initializer": {
                    "class_name": "Ones",
                    "config": {}
                },
                "axis": -1,
                "gamma_constraint": null,
                "gamma_regularizer": null,
                "epsilon": 0.001,
                "center": true,
                "name": "batch_normalization_6",
                "moving_variance_initializer": {
                    "class_name": "Ones",
                    "config": {}
                },
                "moving_mean_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                },
                "beta_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                },
                "beta_regularizer": null,
                "momentum": 0.99,
                "scale": true,
                "beta_constraint": null,
                "trainable": true
            }
        },
        {
            "class_name": "Dropout",
            "config": {
                "seed": null,
                "noise_shape": null,
                "trainable": true,
                "name": "dropout_4",
                "rate": 0.25
            }
        },
        {
            "class_name": "Dense",
            "config": {
                "bias_regularizer": null,
                "kernel_regularizer": null,
                "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                },
                "bias_constraint": null,
                "activation": "linear",
                "name": "dense_2",
                "units": 100,
                "kernel_constraint": null,
                "activity_regularizer": null,
                "use_bias": true,
                "kernel_initializer": {
                    "class_name": "VarianceScaling",
                    "config": {
                        "distribution": "uniform",
                        "seed": null,
                        "scale": 1,
                        "mode": "fan_avg"
                    }
                },
                "trainable": true
            }
        },
        {
            "class_name": "Activation",
            "config": {
                "activation": "softmax",
                "name": "activation_7",
                "trainable": true
            }
        }
    ],
    "backend": "tensorflow"
}